<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"62fb8a00e10888419bb4e74f776330cfff4988650d99029d78819c4b1bca93df","plan_job_ref":"Job Test actions using target and replace #506 at https://github.com/dflook/terraform-github-actions/actions/runs/15351156054","plan_out_hash":"cfce39d2f373ccaf3deac7ce34c99fe5f023b2f093a624ca6eb7e82955f5bb58","plan_hash":"ee1d01cc67d9ce73b653fe4639b5e7f0e5ad0a6a2e8aa3f45587c9a7f89ffded","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "NSz0LadvqF" -> (known after apply)
!~  foreach = "EzlJIA3OFA" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #506](https://github.com/dflook/terraform-github-actions/actions/runs/15351156054)